# Разработайте программу для учёта времени учебы за неделю. Программа должна
# позволять пользователю ввести количество учебных дней (не более семи), а затем для
# каждого дня вводить количество часов, посвящённых учёбе. Программа должна
# обрабатывать ошибки ввода, такие как ввод нечисловых значений и отрицательных
# чисел, и запрашивать повторный ввод при необходимости.
# Указания:
# 1. Используйте цикл while для запроса количества учебных дней, обеспечивая,
# чтобы количество дней не превышало семь и было положительным числом.
number_of_days=int(input("Введите количество дней:"))